class AppStrings {
  static const termOfUse = """
<p><strong>Пользовательское соглашение для Мобильного приложения &laquo;Электронный балкаро-русский словарь&raquo;</strong></p>
<ol>
<li><strong> Введение</strong></li>
</ol>
<p>1.1. Настоящее Соглашение (далее &ndash; "Соглашение") регулирует отношения между ООО "ИНТИГРИС" (далее &ndash; "Компания") и пользователем (далее &ndash; "Пользователь") относительно использования мобильного приложения "Электронный балкаро-русский словарь" (далее &ndash; "Приложение").</p>
<p>1.2. Приложение, предназначенное для перевода слов и словосочетаний с балкарского языка на русский язык, разработанное для мобильных устройств, работающих под управлением операционных систем Android и Apple iOS. Приложение является бесплатным/платным ресурсом, оно доступно Пользователю через сайт и магазин приложений на условиях полного соблюдения Соглашения.</p>
<p>1.3. Установка и использование Приложения в мобильное устройство Пользователя является акцептом настоящего Соглашения и подтверждением согласия Пользователя с его условиями.</p>
<ol start="2">
<li><strong> Предмет соглашения</strong></li>
</ol>
<p>2.1. Компания предоставляет доступ к скачиванию Приложения бесплатно.</p>
<p>2.2. Компания предоставляет пользователям возможность перевода с балкарского на русский язык с различными вариантами подписки, соответствующими различным потребностям и целям использования:</p>
<p>2.2.1. Базовый план: Пользователи имеют возможность переводить до 5 слов в день бесплатно.</p>
<p>2.2.2. Премиум подписка: предоставляет неограниченный доступ ко всем функциям словаря, включая аудио произношение. Стоимость составляет 300 рублей в месяц или 1500 рублей за полгода или 2400 рублей в год.</p>
<p>2.3. Отмена подписки: Пользователи могут отменить подписку в любой момент через настройки аккаунта в приложении. После отмены действующая подписка будет активна до завершения текущего оплаченного периода. Возврат средств за неиспользованные дни не предусмотрен.</p>
<ol start="3">
<li><strong> Регистрация и аккаунт</strong></li>
</ol>
<p>3.1. Для использования Приложения Пользователь обязан создать учетную запись.</p>
<p>&nbsp;</p>
<p>3.2. Пользователь обязан предоставлять достоверную информацию при регистрации и обновлять данные при изменениях.</p>
<ol start="4">
<li><strong> Условия использования</strong></li>
</ol>
<p>4.1. Стороны обязуются соблюдать условия настоящего Соглашения и Правил. Компания вправе в любое время вносить изменения в Правила.</p>
<p>4.2. Компания вправе в любое время изменять тарифы на подписку пп 2.2.2. Стороны считаются ознакомленными с обновленными тарифами должным образом с даты публикации на Сайте обновленных тарифов.</p>
<p>4.3. Компания вправе без дополнительного уведомления приостанавливать работу Приложения в целом или частично для проведения профилактических работ.</p>
<p>4.4. Компания обязуется обеспечить функциональность Приложения.</p>
<p>4.5. Пользователь обязуется использовать Приложение только в законных целях.</p>
<p>4.6. Пользователь обязуется соблюдать условия Соглашения и не разглашать свои учетные данные третьим лицам.</p>
<ol start="5">
<li><strong> Порядок оплаты</strong></li>
</ol>
<p>5.1. Подписка оплачивается через доступные в Приложении платежные системы.</p>
<p>5.2. Подписка автоматически продлевается, если не отменена Пользователем.</p>
<p>5.3. Платежи за подписки не подлежат возврату, за исключением случаев, предусмотренных законодательством.</p>
<ol start="6">
<li><strong> Конфиденциальность и данные</strong></li>
</ol>
<p>6.1. Компания заботится о конфиденциальности и защите личной информации Пользователя.</p>
<p>6.2. Использование Приложения означает согласие Пользователя на обработку его данных согласно Политике конфиденциальности.</p>
<ol start="8">
<li><strong> Изменения соглашения</strong></li>
</ol>
<p>8.1. Компания оставляет за собой право изменять условия Соглашения. Изменения вступают в силу с момента публикации на Сайте.</p>
<p>8.2. Продолжение использования Приложения после внесения изменений означает согласие Пользователя с обновленными условиями.</p>
<p>&nbsp;</p>
<p><strong>Действие Договора</strong></p>
<p>9.1. Настоящий Договор действует до полного исполнения Сторонами своих обязательств.</p>
<p>9.2. Настоящий Договор может быть расторгнут в случаях, установленных законодательством Российской Федерации.</p>
<p>9.3. Настоящий Договор может быть расторгнут по соглашению Сторон, выраженному в письменном виде.</p>
<p>9.4. Действие договора прекращается досрочно в случае прекращения (блокировки) Компанией доступа Пользователя к Приложению в связи с нарушением Пользователем Пользовательского соглашения, или прекращения действия учетной записи по инициативе Пользователя.</p>
<ol start="10">
<li><strong> Заключительные положения</strong></li>
</ol>
<p>10.1. Настоящее Соглашение регулируется законодательством Российской Федерации.</p>
<p>10.2. Все споры, вытекающие из Соглашения, подлежат разрешению в соответствии с законодательством Российской Федерации.</p>
<p>10.3. Если какое-либо положение Соглашения признается недействительным, остальные положения остаются в силе.</p>
<ol start="11">
<li><strong> Обратная связь</strong></li>
</ol>
<p>11.1. Для вопросов и предложений можно обратиться в службу поддержки через интерфейс приложения.</p>
<p>11.2. Адреса и реквизиты Компании:</p>
<p>ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ &laquo;ИНТИГРИС&raquo;</p>
<p>ООО &laquo;ИНТИГРИС&raquo;</p>
<p>ИНН 0700001056</p>
<p>КПП 070001001</p>
<p>Адрес юридического лица: 360001, КАБАРДИНО-БАЛКАРСКАЯ РЕСПУБЛИКА, Г.О. НАЛЬЧИК, г. НАЛЬЧИК, Ул. ПАЧЕВА, д. 13, ОФИС 4</p>
<p>Эл. Почта:&nbsp;ARSENKSAL@GMAIL.COM</p>
<p>Р/с 40702810960330007392 в</p>
<p>СТАВРОПОЛЬСКОЕ ОТДЕЛЕНИЕ N5230 ПАО СБЕРБАНК</p>
<p>г. СТАВРОПОЛЬ</p>
<p>к/с 30101810907020000615</p>
<p>БИК 040702615</p>
<p>Тел. 8-963-280-2332 / 8-928-082-8226</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
""";

  static const aboutUs = """
<p><strong>О приложении</strong></p>

<p>Мобильное приложение &laquo;Электронный балкаро-русский словарь&raquo; &mdash; это инновационное решение, разработанное Федеральным научным центром &laquo;Кабардино-Балкарский научный центр Российской Академии Наук&raquo;, с целью перевода с балкарского на русский, облегчая изучение и использование языка. Оно поддерживает национальные языки с помощью современных технологий и подходит для литературы, науки и общения.</p>
<p>Приложение предоставляет перевод, озвучку и справочную информацию по фонетике и грамматике, поддерживая поиск с ошибками в написании. Удобное для студентов и исследователей, оно превосходит бумажные словари и применяет новейшие технологии, способствуя решению проблем изучения языков.</p>
<p>Мобильное приложение &laquo;Электронный балкаро-русский словарь&raquo; играет важную роль в решении современных проблем, связанных с изучением и сохранением национальных языков, и делает значительный вклад в области образования и науки.</p>
<p>&nbsp;</p>
<p><strong>&nbsp;</strong></p>
<p><strong>&nbsp;</strong></p>
<p>&nbsp;</p>
""";

  static const politics = """
<p><strong>Политика Конфиденциальности Мобильного приложения &laquo;Электронный балкаро-русский словарь&raquo;</strong></p>
<ol>
<li><strong> Введение</strong></li>
</ol>
<p>Политика в отношении конфиденциальности для Мобильного приложения &laquo;Электронный балкаро-русский словарь&raquo;, разработанного Федеральным научным центром &laquo;Кабардино-Балкарский научный центр Российской Академии Наук&raquo;. Мы обрабатываем личные данные пользователей в рамках предоставления услуги мобильного приложения словаря. Мы стремимся защищать вашу конфиденциальность и обрабатывать ваши данные в соответствии с применимыми законами о защите данных.</p>
<ol start="2">
<li><strong> Сбор информации</strong></li>
</ol>
<p>Мы можем собирать следующие данные:</p>
<ul>
<li>Личные данные: информация, которую вы предоставляете нам при регистрации или использовании нашего приложения, такая как имя и адрес электронной почты.</li>
<li>Данные об устройстве: технические данные, включая идентификаторы устройств, IP-адреса, типы браузеров.</li>
</ul>
<ol start="3">
<li><strong> Использование информации</strong></li>
</ol>
<p>Мы используем собранные данные для:</p>
<ul>
<li>Обеспечения и улучшения нашего сервиса.</li>
<li>Персонализации пользовательского опыта.</li>
<li>Анализа использования нашего приложения для улучшения качества предоставляемой услуги.</li>
<li>Связи с вами в ответ на ваши вопросы и уведомления о важных изменениях.</li>
</ul>
<p><strong>&nbsp;</strong></p>
<p><strong>&nbsp;</strong></p>
<ol start="4">
<li><strong> Передача данных третьим лицам</strong></li>
</ol>
<p>Мы не передаем ваши личные данные третьим лицам, за исключением случаев, когда это необходимо для:</p>
<ul>
<li>Соблюдения законодательства страны.</li>
<li>Защиты наших прав и имущества.</li>
<li>Предоставления сервисов, связанных с нашим приложением, через тщательно отобранных партнеров, которые соблюдают наши стандарты конфиденциальности.</li>
</ul>
<ol start="5">
<li><strong> Защита информации</strong></li>
</ol>
<p>Мы принимаем разумные меры безопасности для защиты ваших данных от несанкционированного доступа, изменения и раскрытия. Однако ни одна система передачи данных через Интернет не гарантирует абсолютной безопасности.</p>
<ol start="6">
<li><strong> Ваше согласие</strong></li>
</ol>
<p>Используя приложения &laquo;Электронный балкаро-русский словарь&raquo;, вы соглашаетесь с нашей политикой конфиденциальности.</p>
<ol start="7">
<li><strong> Права пользователей</strong></li>
</ol>
<p>В соответствии с применимыми законами вы имеете право:</p>
<ul>
<li>Запросить доступ к личным данным, которые мы о вас храним.</li>
<li>Исправить или удалить ваши личные данные.</li>
<li>Возражать против обработки ваших данных или ограничить их обработку.</li>
<li>Для осуществления этих прав, пожалуйста, свяжитесь с нами по контактной информации, указанной ниже.</li>
</ul>
<ol start="8">
<li><strong> Изменения в Политике Конфиденциальности</strong></li>
</ol>
<p>Если мы решим изменить нашу политику конфиденциальности приложения, мы опубликуем эти изменения на этой странице и обновим дату изменения политики конфиденциальности приложения ниже.</p>
<p>В последний раз эта политика была обновлена 07&nbsp;октября 2024&nbsp;года.</p>
<ol start="9">
<li><strong> Контактная информация</strong></li>
</ol>
<p>Если у вас есть какие-либо вопросы относительно данной политики конфиденциальности, вы можете связаться с нами по адресу:</p>
<p>Электронная почта: <a href="mailto:kbncran@mail.ru">kbncran@mail.ru</a></p>
<p>&nbsp;</p>
""";
}
